//২টি সংখ্যার গ.সা.গু  ও  ল.সা.গু. নির্ণয় এর প্রোগ্রাম। (ইউক্লিড এর পদ্ধতিতে)
// ১.   a ও  0 এর গ.সা.গু = 0
// ২.   a ও b এর গ.সা.গু = b ও a % b এর গ.সা.গু।

#include <stdio.h>
int main(){

    int a, b, t, x, gcd, lcm;

    scanf("%d", &a);
    scanf("%d", &b);

    if(a == 0){     //যখন  a = 0, তখন গ.সা.গু  = 0 ।
        gcd = a;
    }
    else if(b == 0){    //যখন  b = 0, তখন গ.সা.গু  = 0 ।
        gcd = b;
    }
    else{                   //যখন কোনটিই 0 না।
        while(b != 0){      //যতক্ষন পর্যন্ত b = 0 না হয়।
            t = b;          //ধরি a = 2, b = 4. যেহেতু t = b সুতরাং t = 4।
            b = a % b;      //এখানে b = a % b, বা, b = 2 % 4, বা, b = 2।
            a = t;          //আগ থেকে পাই t = 4, যেহেতু a = t সুতরাং  a = 4।
                            //যেহেতু b = 2 যা b ≠ 0 সুতরাং লুপ আবার চলবে।
                            //আবার t এর মধ্যে b এর মান স্টোর করে পাই t = 2 [∵ b = 2]
                            //আবার b = a % b, বা, b = 4 % 2, বা, b = 0।
                            //আবার t এর মান a তে স্টোর করে পাই t = 2 [∵ প্রথম লুপের পর t = 2 হয়েছে]
                            //যেহেতু b = 0 সুতরাং লুপ আবার চলবে না।
        }
        gcd = a;
    }
    printf("gcd is %d", gcd);   //এখানে gcd = Greatest Common Divisor / গ.সা.গু.

    lcm = (a * b) / gcd;    //আমরা জানি,  ল.সা.গু. × গ.সা.গু. = সংখ্যা দুটির গুনফল
                            //বা, ল.সা.গু. = সংখ্যা দুটির গুনফল / গ.সা.গু.

    printf("lcm is %d", lcm);   //এখানে lcm = Least Common Multiple / ল.সা.গু.


    return 0;
}


