//২টি সংখ্যার গ.সা.গু  নির্ণয় এর প্রোগ্রাম।

#include <stdio.h>
int main(){
    /*দুটি সংখ্যার গ.সা.গু  হচ্ছে যেসব সংখ্যা দিয়ে ওই দুটি সংখ্যা নিঃশেষে বিভাজ্য হয়, তাদের মধ্যে সবথেকে বড় সংখ্যা।*/
    int a, b, x, gcd;
    printf("Input first number: ");
    scanf("%d", &a);
    printf("Input second number: ");
    scanf("%d", &b);
    if(a < b){      //a ও b এর মধ্যে ছোট সংখ্যা = x। এবং গ.সা.গুর মান x থেকে বড় হতে পারেনা।
        x = a;
    }
    else{
        x = b;
    }
    for(; x >= 1; x--){                 //১ দিয়ে সব ভাগ যায় তাই সর্বোনিম্ন সংখ্যা ১।
        if(a % x == 0 && b % x == 0){   //a ও b যদি x দ্বারা ভাগ করলে উভয়ের ভাগশেষ 0 আসে তবে xই গ.সা.গু।
            gcd = x;
            break;
        }
    }
    printf("gcd is %d", gcd);


    return 0;
}
