//একটি অ্যারেতে ১০ টি উপাদান আছে, সেগুলো বিপরীত ক্রোমে রাখতে হবে। যেমন ১ম উপাদান = ১০ম উপাদান, ২য় উপাদান = ৯ম উপাদান।(অদলবদল নিয়ম)

#include <stdio.h>

int main(){
    int arr[] = {10, 20, 30, 40, 50, 60, 70, 80, 90, 100};
    int i, j, temp, ara[10];

    for(i = 0, j = 9; i < 10; i++, j--){
        temp = arr[j];      //arr[j] = arr[9] = 100 = temp
        arr[j] = arr[i];    //arr[i] = arr[0] = 10 = arr[j] = arr[9]
        ara[i] = temp;      //arr[i] = temp = 100
                            //i = 2, j = 8
                            //temp = arr[j] = 8 = 90
                            //arr[j] = arr[i] = 2 = 20
                            //arr[i] = temp = 90
                            //জা হচ্ছে এখানে, ৯তম এরে = ১০০ একটি টেম্পোরারি স্টোরেজ এ জাসচ্ছে, এবং এই এরে তে প্রথম এরে এর মান বস্তিছে, আর প্রথম এরে তে টেম্পোরারি স্টরেজ এর মান বস্টিছে,
    }
    for(i = 0; i < 10; i++){
        printf("%d\n", ara[i]);
    }


    return 0;
}
